n = int(input())
TSIFRI = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь" "девять"]
TSIFRI2 = ["десять", "одинадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шеснадцать", "семнадцать", "восемнадцать", "девятнадцать"]
DESIATIE = ["", "десять", "двадцать ", "тридцать ", "сорок ", "пятьдесят ", "шастьдесят ", "семьдемят ", "восемьдесят ", "девяносто "]
SOTIE = ["", "сто ", "двести ", "триста ", "четыреста ", "пятьсот ", "шестьсот ", "семьсот ", "восемьсот ", "девятьсот "]
n1 = n // 100
n2 = n % 100 // 10
n3 = n % 10
if n2 == 1:
	print(SOTIE[n1], TSIFRI2[n3], sep = "")
else:
	print(SOTIE[n1], DESIATIE[n2], TSIFRI[n3], sep = "")
